sendu2wfdx/RemoteBSP/firmware/boards/stm32f072rbt6/main.c
#include "stm32f0xx_hal.h"

#include "remotebsp_embedded/board_config.h"
#if defined(CONFIG_REMOTEBSP_PWM) || defined(CONFIG_REMOTEBSP_TIMED_BITSTREAM)
#include "remotebsp_embedded/board_waveform.h"
#endif
#include "remotebsp_embedded/byte_ring.h"
#include "remotebsp_embedded/core.h"
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
#include "remotebsp_embedded/soft_half_duplex_uart.h"
#endif
#include "remotebsp_embedded/startup_gpio.h"

#include <string.h>

#if CONFIG_HARDWARE_UART_RESOURCE_COUNT > 0
#define RBSP_HARDWARE_UART_ENABLED 1
#endif

#if CONFIG_SYSTEM_CLOCK_HZ != 48000000
#error "STM32F072RBT6 当前系统时钟必须为 48MHz"
#endif

#ifdef RBSP_HARDWARE_UART_ENABLED
#if CONFIG_HARDWARE_UART_RESOURCE_COUNT > 1
#error "当前 F072 通用 BSP 只实现 UART 0/USART1"
#endif
#if !defined(CONFIG_UART0_PINS_PA9_PA10) && \
    !defined(CONFIG_UART0_PINS_PB6_PB7)
#error "启用 F072 UART 时必须选择 USART1 引脚组"
#endif
#if CONFIG_UART_RX_BUFFER_SIZE < 2 || CONFIG_UART_TX_BUFFER_SIZE < 2
#error "UART 环形缓冲至少需要两个字节"
#endif
#endif

#if (48000000U % (CONFIG_CAN_NOMINAL_BITRATE * 16U)) != 0
#error "当前 F072 CAN 位时序无法精确生成所选仲裁段波特率"
#endif

#define CAN_PRESCALER \
    (48000000U / (CONFIG_CAN_NOMINAL_BITRATE * 16U))
#define F072_VECTOR_WORDS 48U
#define F072_SRAM_SIZE (16U * 1024U)

#if CAN_PRESCALER < 1 || CAN_PRESCALER > 1024
#error "F072 CAN 分频系数超出硬件范围"
#endif

static CAN_HandleTypeDef can_handle;
static rbsp_core_t remote_core;

#ifdef CONFIG_REMOTEBSP_MOTION
#ifdef CONFIG_MOTION_SLOT0_ENABLED
#define MOTION_SLOT0_AXIS_COUNT 1U
#else
#define MOTION_SLOT0_AXIS_COUNT 0U
#endif
#ifdef CONFIG_MOTION_SLOT1_ENABLED
#define MOTION_SLOT1_AXIS_COUNT 1U
#else
#define MOTION_SLOT1_AXIS_COUNT 0U
#endif
#ifdef CONFIG_MOTION_SLOT2_ENABLED
#define MOTION_SLOT2_AXIS_COUNT 1U
#else
#define MOTION_SLOT2_AXIS_COUNT 0U
#endif
#ifdef CONFIG_MOTION_SLOT3_ENABLED
#define MOTION_SLOT3_AXIS_COUNT 1U
#else
#define MOTION_SLOT3_AXIS_COUNT 0U
#endif
#ifdef CONFIG_MOTION_SLOT4_ENABLED
#define MOTION_SLOT4_AXIS_COUNT 1U
#else
#define MOTION_SLOT4_AXIS_COUNT 0U
#endif

#define MOTION_SLOT_AXIS_COUNT \
    (MOTION_SLOT0_AXIS_COUNT + MOTION_SLOT1_AXIS_COUNT + \
     MOTION_SLOT2_AXIS_COUNT + MOTION_SLOT3_AXIS_COUNT + \
     MOTION_SLOT4_AXIS_COUNT)

#if MOTION_SLOT_AXIS_COUNT == 0U
#error "启用运动模块时至少要启用一个本板运动槽"
#endif
#if MOTION_SLOT_AXIS_COUNT > CONFIG_MOTION_MAX_AXES
#error "已启用的本板运动槽数量不能超过 MOTION_MAX_AXES"
#endif

typedef struct {
    uint8_t port;
    uint8_t pin;
} motion_pin_t;

typedef struct {
    motion_pin_t step;
    motion_pin_t direction;
    motion_pin_t enable;
    bool direction_inverted;
    bool enable_active_low;
} motion_axis_pins_t;

/* 所有数值均来自 menuconfig 的 MOTION_SLOTn_* 配置，而非板级源码常量。 */
static const motion_axis_pins_t motion_axis_pins[MOTION_SLOT_AXIS_COUNT] = {
#ifdef CONFIG_MOTION_SLOT0_ENABLED
    {{CONFIG_MOTION_SLOT0_STEP_PIN / 16U, CONFIG_MOTION_SLOT0_STEP_PIN % 16U},
     {CONFIG_MOTION_SLOT0_DIR_PIN / 16U, CONFIG_MOTION_SLOT0_DIR_PIN % 16U},
     {CONFIG_MOTION_SLOT0_ENABLE_PIN / 16U, CONFIG_MOTION_SLOT0_ENABLE_PIN % 16U},
#ifdef CONFIG_MOTION_SLOT0_DIR_INVERTED
     true,
#else
     false,
#endif
#ifdef CONFIG_MOTION_SLOT0_ENABLE_ACTIVE_LOW
     true},
#else
     false},
#endif
#endif
#ifdef CONFIG_MOTION_SLOT1_ENABLED
    {{CONFIG_MOTION_SLOT1_STEP_PIN / 16U, CONFIG_MOTION_SLOT1_STEP_PIN % 16U},
     {CONFIG_MOTION_SLOT1_DIR_PIN / 16U, CONFIG_MOTION_SLOT1_DIR_PIN % 16U},
     {CONFIG_MOTION_SLOT1_ENABLE_PIN / 16U, CONFIG_MOTION_SLOT1_ENABLE_PIN % 16U},
#ifdef CONFIG_MOTION_SLOT1_DIR_INVERTED
     true,
#else
     false,
#endif
#ifdef CONFIG_MOTION_SLOT1_ENABLE_ACTIVE_LOW
     true},
#else
     false},
#endif
#endif
#ifdef CONFIG_MOTION_SLOT2_ENABLED
    {{CONFIG_MOTION_SLOT2_STEP_PIN / 16U, CONFIG_MOTION_SLOT2_STEP_PIN % 16U},
     {CONFIG_MOTION_SLOT2_DIR_PIN / 16U, CONFIG_MOTION_SLOT2_DIR_PIN % 16U},
     {CONFIG_MOTION_SLOT2_ENABLE_PIN / 16U, CONFIG_MOTION_SLOT2_ENABLE_PIN % 16U},
#ifdef CONFIG_MOTION_SLOT2_DIR_INVERTED
     true,
#else
     false,
#endif
#ifdef CONFIG_MOTION_SLOT2_ENABLE_ACTIVE_LOW
     true},
#else
     false},
#endif
#endif
#ifdef CONFIG_MOTION_SLOT3_ENABLED
    {{CONFIG_MOTION_SLOT3_STEP_PIN / 16U, CONFIG_MOTION_SLOT3_STEP_PIN % 16U},
     {CONFIG_MOTION_SLOT3_DIR_PIN / 16U, CONFIG_MOTION_SLOT3_DIR_PIN % 16U},
     {CONFIG_MOTION_SLOT3_ENABLE_PIN / 16U, CONFIG_MOTION_SLOT3_ENABLE_PIN % 16U},
#ifdef CONFIG_MOTION_SLOT3_DIR_INVERTED
     true,
#else
     false,
#endif
#ifdef CONFIG_MOTION_SLOT3_ENABLE_ACTIVE_LOW
     true},
#else
     false},
#endif
#endif
#ifdef CONFIG_MOTION_SLOT4_ENABLED
    {{CONFIG_MOTION_SLOT4_STEP_PIN / 16U, CONFIG_MOTION_SLOT4_STEP_PIN % 16U},
     {CONFIG_MOTION_SLOT4_DIR_PIN / 16U, CONFIG_MOTION_SLOT4_DIR_PIN % 16U},
     {CONFIG_MOTION_SLOT4_ENABLE_PIN / 16U, CONFIG_MOTION_SLOT4_ENABLE_PIN % 16U},
#ifdef CONFIG_MOTION_SLOT4_DIR_INVERTED
     true,
#else
     false,
#endif
#ifdef CONFIG_MOTION_SLOT4_ENABLE_ACTIVE_LOW
     true},
#else
     false},
#endif
#endif
};

static const uint16_t motion_enable_group_ids[MOTION_SLOT_AXIS_COUNT] = {
#ifdef CONFIG_MOTION_SLOT0_ENABLED
    CONFIG_MOTION_SLOT0_ENABLE_PIN,
#endif
#ifdef CONFIG_MOTION_SLOT1_ENABLED
    CONFIG_MOTION_SLOT1_ENABLE_PIN,
#endif
#ifdef CONFIG_MOTION_SLOT2_ENABLED
    CONFIG_MOTION_SLOT2_ENABLE_PIN,
#endif
#ifdef CONFIG_MOTION_SLOT3_ENABLED
    CONFIG_MOTION_SLOT3_ENABLE_PIN,
#endif
#ifdef CONFIG_MOTION_SLOT4_ENABLED
    CONFIG_MOTION_SLOT4_ENABLE_PIN,
#endif
};
static bool motion_enable_requests[MOTION_SLOT_AXIS_COUNT];

#ifdef CONFIG_MOTION_SLOT_LIMIT_INPUTS
typedef struct {
    bool present;
    motion_pin_t pin;
} motion_limit_pin_t;

static const motion_limit_pin_t motion_limit_pins[MOTION_SLOT_AXIS_COUNT] = {
#ifdef CONFIG_MOTION_SLOT0_ENABLED
    {CONFIG_MOTION_SLOT0_LIMIT_PIN >= 0,
     {CONFIG_MOTION_SLOT0_LIMIT_PIN / 16U, CONFIG_MOTION_SLOT0_LIMIT_PIN % 16U}},
#endif
#ifdef CONFIG_MOTION_SLOT1_ENABLED
    {CONFIG_MOTION_SLOT1_LIMIT_PIN >= 0,
     {CONFIG_MOTION_SLOT1_LIMIT_PIN / 16U, CONFIG_MOTION_SLOT1_LIMIT_PIN % 16U}},
#endif
#ifdef CONFIG_MOTION_SLOT2_ENABLED
    {CONFIG_MOTION_SLOT2_LIMIT_PIN >= 0,
     {CONFIG_MOTION_SLOT2_LIMIT_PIN / 16U, CONFIG_MOTION_SLOT2_LIMIT_PIN % 16U}},
#endif
#ifdef CONFIG_MOTION_SLOT3_ENABLED
    {CONFIG_MOTION_SLOT3_LIMIT_PIN >= 0,
     {CONFIG_MOTION_SLOT3_LIMIT_PIN / 16U, CONFIG_MOTION_SLOT3_LIMIT_PIN % 16U}},
#endif
#ifdef CONFIG_MOTION_SLOT4_ENABLED
    {CONFIG_MOTION_SLOT4_LIMIT_PIN >= 0,
     {CONFIG_MOTION_SLOT4_LIMIT_PIN / 16U, CONFIG_MOTION_SLOT4_LIMIT_PIN % 16U}},
#endif
};
#endif

